/* 몬소린지 하나씩 다시 볼 것
반환값이 있는 함수
*/

add();
add();

add100(10); // 전달 받은 숫자가 10이다. 
add100(20);

sum(10, 20);
sum(30, 40);


// 10 + 100의 결과를 출력하는 함수
add(10 + 100);
add(10 + 100);


// 전달받은 숫자와 100의 합계를 출력하는 함수
function (add100) {
  console.log(10, 20);

}

// 전달받은 두 숫자의 합계를 출력하는 함수


add(); //110
add(); //110

add100(10); //110
add100(20); //120

sum(10, 20); //30
sum(30, 20); //70



// 10+100 결과를 출력한다(add)

function add() { // 뭘할지 정해져 있다. 10과 100의 합계를 출력
  const n1 = 10;
  const n2 = 100;
  console.log(n1 + n2);
}

// 전달받은 숫자와 100의 합계를 출력하는 함수(add100)
function sum(n1, n2) { // 10을 전달하면 110이 된다. 
  console.log(num + 100);
}
// 전달받은 두 숫자의 합계를 출력하는 함수(sum)
function sum(n1, n2) {
  console.log(num1 + num2);
}